# Задача 2: Найдите сумму цифр трехзначного числа.


i = int(input("Введите число 1 :"))
j = int(input("Введите число 2: "))
print(i+j)
