#Задача 2: Найдите сумму цифр трехзначного числа.
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) |

i = int(input("Введите число 1 :"))
j = int(input("Введите число 2: "))
print(i+j)